Repository: stefansbv/qdepo
Catalog: po/*.po
Languages: ro

source: {ert} Read failed: {message} ({filename})
ro: {ert} Citire eșuată: {message} ({filename})

source: Unknown exception
ro: Eroare necunoscută

source: {ert} Connected
ro: {ert} Conectat

source: {ert} Failed to connect
ro: {ert} Conectare eșuată

source: {ert} Disconnected
ro: {ert} Deconectat

source: {ert} Loading item #{item}
ro: {ert} Încărcare articol #{item}

source: {ert} Please, edit the SQL statement
ro: {ert} Rog, editați comanda SQL

source: {ert} Please, edit the output file name
ro: {ert} Editați numele fișierului de ieșire

source: {ert} Running data export...
ro: {ert} Execut exportul de date...

source: Wrong output path
ro: Cale de ieșiere eronată

source: {ert} Wrong output path: {outpath}
ro: {ert} Cale de ieșiere eronată: {outpath}

source: Generated {rows} rows ({percent}%)
ro: {rows} înregistrări generate ({percent}%)

source: {ert} Output generated, {rows} rows ({percent}%)
ro: {ert} Fișier de ieșire generat, {rows} înregistrări ({percent}%)

source: No output file generated
ro: Nu s-a generat fișierul

source: {ert} No output file generated
ro: {ert} Nu s-a generat fișierul de ieșire

source: {ert} Saved "{name}{ext}"
ro: {ert} Salvat "{name}{ext}"

source: {ert} File exists ({dst_fqn})
ro: {ert} Fișierul există ({dst_fqn})

source: {ert} Create new report from template ...
ro: {ert} Creează raport nou după model ...

source: {ert} Created "{new_qdf_file}"
ro: {ert} Am creat "{new_qdf_file}"

source: {ert} Failed: {error}
ro: {ert} Eșuat: {error}

source: {ert} Report "{file}" not found!
ro: {ert} Fișier raport "{file}"

source: {ert} Removed "{file}"
ro: {ert} Șters "{file}"

source: {ert} Remove "{file}" failed
ro: {ert} Ștergere "{file}" eșuată

source: {ert} Output format set to "{choice}"
ro: {ert} Format de ieșire "{choice}"

source: {ert} Parameter mismatch, to few parameters in SQL
ro: {ert} Neconcordanță la parametri, prea puțini parametri în SQL

source: {ert} Parameter mismatch, to many parameters in SQL
ro: {ert} Neconcordanță la parametri, prea mulți parametri în SQL

source: Query name
ro: Nume interogare

source: Name
ro: Nume

source: Type
ro: Tip

source: Default
ro: Implicit

source: Current
ro: Curent

source: Database
ro: Bază de date

source: {ert} Item data missing!
ro: {ert} Datele articolului lipsesc!

source: The {table} table does not exists
ro: Tablela {table} nu există

source: Can not get the name of the table
ro: Nu pot afla numele tabelului

source: {ert} Not implemented: "table_info_short"
ro: {ert} Neimplementat: "table_info_short"

source: Yes
ro: Da

source: {ert} Starting QDepo {verbose}
ro: {ert} Start QDepo {verbose}

source: Export data
ro: Exportă

source: &Save
ro: &Salvează

source: &Cancel
ro: &Renunță

source: &Edit
ro: &Editare

source: &Add
ro: &Adaugă

source: Delete marked reports and quit?
ro: Ștergeți rapoartele marcate și ieșiți?

source: {ert} No configuration mnemonic loaded
ro: {ert} Nici un mnemonic de configurație încărcat

source: {ert} Loading mnemonic "{mnemonic}"
ro: {ert} Încărcare mnemonic "{mnemonic}"

source: {ert} Loading selected mnemonic "{mnemonic}"
ro: {ert} Încărcare mnemonic selectat "{mnemonic}"

source: Not connected
ro: Neconectat

source: Connect to {driver}: {dbname}
ro: Conectare la {driver}: {dbname}

source: {ert} Login cancelled
ro: {ert} Autentificare abandonată

source: Wrong user and/or password
ro: Utilizator sau/și parolă greșită

source: User and password is required
ro: Utilizatorul și parola sunt necesare

source: {ert} New connection: {newconn}
ro: {ert} Conexiune nouă: {newconn}

source: {ert} No selected mnemonic
ro: {ert} Nici un mnemonic selectat

source: {ert} Saved: "{filename}"
ro: {ert} Salvat: "{filename}"

source: Unknown error
ro: Eroare necunoscută

source: {ert} Save failed: {message} ({filename})
ro: {ert} Savare eșuată: {message} ({filename})

source: {ert} {module} is not available
ro: {ert} {module} nu este disponibil

source: No output file parameter
ro: Fără parametrul fișier

source: No SQL parameter!
ro: SQL fără parametri!

source: {ert} Generating output file "{outfile}"
ro: {ert} Generez fișierul "{outfile}"

source: {ert} {option} is not implemented
ro: {ert} {option} nu este implementat

source: {ert} Count: {rows_cnt} total rows
ro: {ert} Număr: {rows_cnt} total înregistrări

source: {ert} Could not count rows!
ro: {ert} Nu am putut pot număra înregistrările!

source: {ert} Can not count the output rows or rows_no <= 0
ro: {ert} Nu pot număra rândurile sau rows_no <= 0

source: one row
ro: un rând

source: {ert} Failed to extract FROM clause
ro: {ert} Extragerea clauzei FROM a eșuat

source: {ert} Stopped at user request
ro: {ert} Oprit la cererea utilizatorului

source: Columns record
ro: Înregistare coloane

source: {qdf_file} is not a valid XML file
ro: {qdf_file} nu este un fișier XML valid

source: {qdf_file} is not a valid qdf file
ro: {qdf_file} nu este un fișier qdf valid

source: Reading qdf files...
ro: citește fișierele qdf...

source: No .qdf files to process
ro: Nici un fișier .qdf de procesat

source: one qdf file
ro: un fișier qdf

source: Query list
ro: Listă interogări

source: Description
ro: Descriere

source: Table name
ro: Nume tabel

source: Fields
ro: Câmpuri

source: &Load
ro: Î&ncarcă

source: &Default
ro: &Implicit

source: Connection
ro: Conexiune

source: Label
ro: Etichetă

source: Value
ro: Valori

source: Parameters
ro: Parametri

source: Title
ro: Titlu

source: Query file
ro: Fișier interogare

source: Output file
ro: Fișier ieșire

source: Template
ro: Model

source: Header
ro: Antet

source: Host
ro: Gazdă

source: Connection details
ro: Detalii de conexiune

source: Error
ro: Eroare

source: Confirm
ro: Confirmă

source: Queries
ro: Interogări

source: Admin
ro: Administrare

source: Enter configuration name
ro: Introdu numele configurației

source: Entry dialog
ro: Dialog introducere date

source: {ert} User cancelled the action
ro: {ert} Utilizatorul a abandonat acțiunea

source: {ert} {driver} engine is not implemented
ro: {ert} motorul {driver} nu este implementat

source: App
ro: Aplicație

source: Quit
ro: Exit

source: Help
ro: Ajutor

source: About
ro: Despre

source: Run
ro: Execută

source: Execute query
ro: Execută interogare

source: Add query
ro: Adaugă interogare

source: Create new qdf file
ro: Crează fișier qdf nou

source: Quit the application
ro: Închide aplicația

source: Remove query
ro: Șterge interogare

source: Remove the qdf file
ro: Șterge fișierul qdf

source: Save metadata
ro: Salvează metadate

source: Edit metadata
ro: Editează metadate

source: Toggle edit mode
ro: Comutare mod editare
